app/controllers/events_controller.rb

INSERT INTO "events" ("name", "location", "date", "created_at", "updated_at", "creator_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Matthew's Birthday"], ["location", "lil avery"], ["date", "2017-07-24"], ["created_at", "2017-06-12 20:58:36.732344"], ["updated_at", "2017-06-12 20:58:36.732344"], ["creator_id", 1]]
---
  def create
    @event = current_user.created_events.build(event_params)